## Data Acquisition Exercises

4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [67]:
import pandas as pd
import env

In [68]:
from pydataset import data
df_iris = data('iris')

- print the first 3 rows

In [69]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [70]:
df_iris.shape

(150, 5)

- print the column names

In [71]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [72]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [73]:
df_iris.agg(
    {
        "Sepal.Length": ["min", "max", "median", "mean", "skew"],
        "Sepal.Width": ["min", "max", "median", "mean", "skew"],
        "Petal.Length": ["min", "max", "median", "mean", "skew"],
        "Petal.Width": ["min", "max", "median", "mean", "skew"],
    }
)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
min         4.300000     2.000000      1.000000     0.100000
max         7.900000     4.400000      6.900000     2.500000
median      5.800000     3.000000      4.350000     1.300000
mean        5.843333     3.057333      3.758000     1.199333
skew        0.314911     0.318966     -0.274884    -0.102967

In [74]:
# or: 
stats = df_iris.describe().T
stats

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

5. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [75]:
df_excel = pd.read_clipboard()
df_excel.head()

Empty DataFrame
Columns: [species]
Index: []

- assign the first 100 rows to a new dataframe, df_excel_sample

In [76]:
df_excel_sample = df_excel.head(100)
#df_excel_sample

- print the number of rows of your original dataframe

In [77]:
len(df_excel.index)

0

In [78]:
# or:
df_excel.shape[0]

0

- print the first 5 column names

In [79]:
df_excel.columns[0:5]

Index(['species'], dtype='object')

- print the column names that have a data type of object

In [80]:
list(df_excel.select_dtypes(include=['object']).columns)

['species']

In [81]:
# or:
df_excel.columns[df_excel.dtypes == object]

Index(['species'], dtype='object')

- compute the range for each of the numeric variables.

In [82]:
df_excel.dtypes

species    object
dtype: object

In [83]:
stats = df_excel.describe().T
stats

        count unique  top freq
species     0      0  NaN  NaN

In [84]:
stats['range'] = stats['max'] - stats['min']
stats[['range']]

KeyError: 'max'

6. Read the data from this google sheet into a dataframe, df_google

In [85]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1zw2b2UMnla_ZFTH_r8BsdhCnuUSi4gBdqKNX2I3X85M/edit#gid=341089357'

In [86]:
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [87]:
df_google = pd.read_csv(csv_export_url)

- print the first 3 rows

In [88]:

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- print the number of rows and columns

In [89]:
df_google.shape

(891, 12)

- print the column names

In [90]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

- print the data type of each column

In [91]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- print the summary statistics for each of the numeric variables

In [92]:
stats2 = df_google.describe().T
stats2

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

- print the unique values for each of your categorical variables

In [93]:
for col in df_google:
    if df_google[col].dtypes == 'object':
        print(f'{col} has {df_google[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

## Data Preparation Exercises

The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

### Using the Iris Data:

1.  Use the function defined in acquire.py to load the iris data.

In [94]:
import acquire
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

In [113]:
iris_df = acquire.get_iris_data()
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [96]:
df.shape

(150, 6)

2. Drop the species_id and measurement_id columns.

In [114]:
cols_to_drop = ['species_id']
iris_df = iris_df.drop(columns=cols_to_drop)
iris_df.shape

(150, 5)

In [115]:
iris_df.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

3. Rename the species_name column to just species.

In [116]:
iris_df = iris_df.rename(columns={'species_name' : 'species'})

In [117]:
iris_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

4. Create dummy variables of the species name and concatenate onto the iris dataframe.

In [157]:
dummy_iris_df = pd.get_dummies(iris_df[['species']], dummy_na=False, drop_first=[True])
dummy_df

     sex_male  embark_town_Queenstown  embark_town_Southampton
0           1                       0                        1
1           0                       0                        0
2           0                       0                        1
3           0                       0                        1
4           1                       0                        1
..        ...                     ...                      ...
886         1                       0                        1
887         0                       0                        1
888         0                       0                        1
889         1                       0                        0
890         1                       1                        0

[891 rows x 3 columns]

In [119]:
iris_df = pd.concat([iris_df, dummy_df], axis=1)
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [159]:
def prep_iris(iris_df):
    cols_to_drop = ['species_id']
    iris_df = iris_df.drop(columns=cols_to_drop)
    iris_df = iris_df.rename(columns={'species_name' : 'species'})
    dummy_df = pd.get_dummies(iris_df[['species']], dummy_na=False, drop_first=[True])
    iris_df = pd.concat([iris_df, dummy_df], axis=1)
    return iris_df

In [160]:
iris_df = acquire.get_iris_data()
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [161]:
iris_df = prep_iris(iris_df)
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

Extra: split iris data

In [162]:
train, test = train_test_split(iris_df, test_size = .2, random_state=123, stratify=df.species)

In [163]:
print(train.shape)
print(test.shape)

(120, 7)
(30, 7)

In [164]:
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.species)

In [165]:
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

Train: (84, 7)
Validate: (36, 7)
Test: (30, 7)

### Using the Titanic dataset

1. Use the function defined in acquire.py to load the Titanic data.

In [132]:
titanic_df = acquire.get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

2. Drop any unnecessary, unhelpful, or duplicated columns.

In [133]:
print(df.shape)
titanic_df = titanic_df.drop_duplicates()
print(titanic_df.shape)

(150, 7)
(891, 13)

In [134]:
cols_to_drop = ['deck', 'embarked', 'class', 'age']
titanic_df = titanic_df.drop(columns=cols_to_drop)
titanic_df.shape

(891, 9)

In [135]:
titanic_df.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [137]:
dummy_df = pd.get_dummies(titanic_df[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
dummy_df

     sex_male  embark_town_Queenstown  embark_town_Southampton
0           1                       0                        1
1           0                       0                        0
2           0                       0                        1
3           0                       0                        1
4           1                       0                        1
..        ...                     ...                      ...
886         1                       0                        1
887         0                       0                        1
888         0                       0                        1
889         1                       0                        0
890         1                       1                        0

[891 rows x 3 columns]

In [171]:
titanic_df = pd.concat([titanic_df, dummy_df], axis=1)
titanic_df.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,male,1,0,7.2500,Southampton,0,1,0,1,1,0,1
1,1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0,0,0,0
2,2,1,3,female,0,0,7.9250,Southampton,1,0,0,1,0,0,1
3,3,1,1,female,1,0,53.1000,Southampton,0,0,0,1,0,0,1
4,4,0,3,male,0,0,8.0500,Southampton,1,1,0,1,1,0,1

4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [139]:
def prep_titanic(titanic_df):
    '''
    This function will clean the titanic data...
    '''
    titanic_df = titanic_df.drop_duplicates()
    cols_to_drop = ['deck', 'embarked', 'class', 'age']
    titanic_df = titanic_df.drop(columns=cols_to_drop)
    dummy_df = pd.get_dummies(titanic_df[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
    titanic_df = pd.concat([titanic_df, dummy_df], axis=1)
    return titanic_df

In [140]:
titanic_df = acquire.get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [142]:

titanic_df = prep_titanic(titanic_df)
titanic_df.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,4,0,3,male,0,0,8.0500,Southampton,1,1,0,1

Extra: Split titanic data

In [148]:
train, test = train_test_split(titanic_df, test_size = .2, random_state=123, stratify=titanic_df.survived)

In [149]:
print(train.shape)
print(test.shape)

(712, 12)
(179, 12)

In [150]:
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.survived)

In [151]:
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

Train: (498, 12)
Validate: (214, 12)
Test: (179, 12)

In [154]:
def split_data(titanic_df):
    '''
    Takes in a dataframe and return train, validate, test subset dataframes
    '''
    train, test = train_test_split(titanic_df, test_size = .2, random_state=123, stratify=titanic_df.survived)
    train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.survived)
    return train, validate, test

In [155]:
titanic_df.shape

(891, 12)

In [156]:
train, validate, test = split_data(titanic_df)
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

Train: (498, 12)
Validate: (214, 12)
Test: (179, 12)

### Using the Telco dataset

1. Use the function defined in aquire.py to load the Telco data.

In [167]:
telco_df = acquire.get_telco_data()
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,3,0016-QLJIS,Female,0,Yes,Yes,65,Yes,...,Yes,Yes,Yes,Yes,90.45,5957.9,No,Two year,DSL,Mailed check
1,4,1,3,0017-DINOC,Male,0,No,No,54,No,...,Yes,Yes,No,No,45.20,2460.55,No,Two year,DSL,Credit card (automatic)
2,3,1,3,0019-GFNTW,Female,0,No,No,56,No,...,Yes,No,No,No,45.05,2560.1,No,Two year,DSL,Bank transfer (automatic)
3,4,1,3,0056-EPFBG,Male,0,Yes,Yes,20,No,...,Yes,No,No,Yes,39.40,825.4,No,Two year,DSL,Credit card (automatic)
4,3,1,3,0078-XZMHT,Male,0,Yes,No,72,Yes,...,Yes,Yes,Yes,Yes,85.15,6316.2,No,Two year,DSL,Bank transfer (automatic)

2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [169]:
print(telco_df.shape)
telco_df = telco_df.drop_duplicates()
print(telco_df.shape)

(7043, 24)
(7043, 24)

In [189]:
for col in telco_df:
    print(col)
    print(telco_df[col].value_counts())

customer_id
7493-TPUWZ    1
2703-AMTUL    1
7319-VENRZ    1
1394-SUIUH    1
2851-MMUTZ    1
             ..
1785-BPHTP    1
1902-XBTFB    1
6323-AYBRX    1
2320-SLKMB    1
4110-PFEUZ    1
Name: customer_id, Length: 7043, dtype: int64
gender
Male      3555
Female    3488
Name: gender, dtype: int64
senior_citizen
0    5901
1    1142
Name: senior_citizen, dtype: int64
partner
No     3641
Yes    3402
Name: partner, dtype: int64
dependents
No     4933
Yes    2110
Name: dependents, dtype: int64
tenure
1     613
72    362
2     238
3     200
4     176
71    170
5     133
7     131
8     123
70    119
9     119
12    117
10    116
6     110
13    109
68    100
11     99
15     99
67     98
18     97
69     95
24     94
22     90
66     89
35     88
17     87
23     85
56     80
52     80
64     80
16     80
26     79
25     79
60     76
61     76
65     76
14     76
46     74
19     73
27     72
29     72
30     72
63     72
20     71
62     70
41     70
53     70
32     69
50     68
54     68
51     68
47     68
58     67
49     66
31     65
43     65
42     65
34     65
57     65
37     65
40     64
48     64
55     64
33     64
21     63
45     61
59     60
38     59
28     57
39     56
44     51
36     50
0      11
Name: tenure, dtype: int64
phone_service
Yes    6361
No      682
Name: phone_service, dtype: int64
multiple_lines
No                  3390
Yes                 2971
No phone service     682
Name: multiple_lines, dtype: int64
online_security
No                     3498
Yes                    2019
No internet service    1526
Name: online_security, dtype: int64
online_backup
No                     3088
Yes                    2429
No internet service    1526
Name: online_backup, dtype: int64
device_protection
No                     3095
Yes                    2422
No internet service    1526
Name: device_protection, dtype: int64
tech_support
No                     3473
Yes                    2044
No internet service    1526
Name: tech_support, dtype: int64
streaming_tv
No                     2810
Yes                    2707
No internet service    1526
Name: streaming_tv, dtype: int64
streaming_movies
No                     2785
Yes                    2732
No internet service    1526
Name: streaming_movies, dtype: int64
paperless_billing
Yes    4171
No     2872
Name: paperless_billing, dtype: int64
monthly_charges
20.05     61
19.85     45
19.90     44
19.95     44
20.00     43
          ..
30.30      1
56.45      1
117.50     1
40.00      1
97.25      1
Name: monthly_charges, Length: 1585, dtype: int64
total_charges
           11
20.2       11
19.75       9
19.9        8
19.65       8
           ..
1859.1      1
520.55      1
4454.25     1
200.2       1
5705.05     1
Name: total_charges, Length: 6531, dtype: int64
churn
No     5174
Yes    1869
Name: churn, dtype: int64
contract_type
Month-to-month    3875
Two year          1695
One year          1473
Name: contract_type, dtype: int64
internet_service_type
Fiber optic    3096
DSL            2421
None           1526
Name: internet_service_type, dtype: int64
payment_type
Electronic check             2365
Mailed check                 1612
Bank transfer (automatic)    1544
Credit card (automatic)      1522
Name: payment_type, dtype: int64
gender_Male
1    3555
0    3488
Name: gender_Male, dtype: int64
contract_type_One year
0    5570
1    1473
Name: contract_type_One year, dtype: int64
contract_type_Two year
0    5348
1    1695
Name: contract_type_Two year, dtype: int64
internet_service_type_Fiber optic
0    3947
1    3096
Name: internet_service_type_Fiber optic, dtype: int64
internet_service_type_None
0    5517
1    1526
Name: internet_service_type_None, dtype: int64
payment_type_Credit card (automatic)
0    5521
1    1522
Name: payment_type_Credit card (automatic), dtype: int64
payment_type_Electronic check
0    4678
1    2365
Name: payment_type_Electronic check, dtype: int64
payment_type_Mailed check
0    5431
1    1612
Name: payment_type_Mailed check, dtype: int64

In [170]:
cols_to_drop = ['payment_type_id', 'internet_service_type_id', 'contract_type_id']
telco_df = telco_df.drop(columns=cols_to_drop)
telco_df.shape

(7043, 21)

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [173]:
dummy_df = pd.get_dummies(telco_df[['gender', 'contract_type', 'internet_service_type', 'payment_type']], dummy_na=False, drop_first=[True, True, True, True])
dummy_df

,gender_Male,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,0,1,0,0,0,0,1
1,1,0,1,0,0,1,0,0
2,0,0,1,0,0,0,0,0
3,1,0,1,0,0,1,0,0
4,1,0,1,0,0,0,0,0
...,...,...,...,...,...,...,...,...
7038,0,0,0,0,1,0,0,1
7039,0,0,0,0,1,0,0,1
7040,0,0,0,0,1,1,0,0
7041,1,0,0,0,1,0,0,1
7042,0,0,0,0,1,0,0,0

In [175]:
telco_df = pd.concat([telco_df, dummy_df], axis=1)
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,internet_service_type,payment_type,gender_Male,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0016-QLJIS,Female,0,Yes,Yes,65,Yes,Yes,Yes,Yes,...,DSL,Mailed check,0,0,1,0,0,0,0,1
1,0017-DINOC,Male,0,No,No,54,No,No phone service,Yes,No,...,DSL,Credit card (automatic),1,0,1,0,0,1,0,0
2,0019-GFNTW,Female,0,No,No,56,No,No phone service,Yes,Yes,...,DSL,Bank transfer (automatic),0,0,1,0,0,0,0,0
3,0056-EPFBG,Male,0,Yes,Yes,20,No,No phone service,Yes,No,...,DSL,Credit card (automatic),1,0,1,0,0,1,0,0
4,0078-XZMHT,Male,0,Yes,No,72,Yes,Yes,No,Yes,...,DSL,Bank transfer (automatic),1,0,1,0,0,0,0,0

4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [176]:
def prep_telco(telco_df):
    '''
    This function will clean the telco data...
    '''
    telco_df = telco_df.drop_duplicates()
    cols_to_drop = ['payment_type_id', 'internet_service_type_id', 'contract_type_id']
    telco_df = telco_df.drop(columns=cols_to_drop)
    dummy_df = pd.get_dummies(telco_df[['gender', 'contract_type', 'internet_service_type', 'payment_type']], dummy_na=False, drop_first=[True, True, True, True])
    telco_df = pd.concat([telco_df, dummy_df], axis=1)
    return telco_df

In [177]:
telco_df = acquire.get_telco_data()
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,3,0016-QLJIS,Female,0,Yes,Yes,65,Yes,...,Yes,Yes,Yes,Yes,90.45,5957.9,No,Two year,DSL,Mailed check
1,4,1,3,0017-DINOC,Male,0,No,No,54,No,...,Yes,Yes,No,No,45.20,2460.55,No,Two year,DSL,Credit card (automatic)
2,3,1,3,0019-GFNTW,Female,0,No,No,56,No,...,Yes,No,No,No,45.05,2560.1,No,Two year,DSL,Bank transfer (automatic)
3,4,1,3,0056-EPFBG,Male,0,Yes,Yes,20,No,...,Yes,No,No,Yes,39.40,825.4,No,Two year,DSL,Credit card (automatic)
4,3,1,3,0078-XZMHT,Male,0,Yes,No,72,Yes,...,Yes,Yes,Yes,Yes,85.15,6316.2,No,Two year,DSL,Bank transfer (automatic)

In [178]:
telco_df = prep_telco(telco_df)
telco_df.head()

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,...,internet_service_type,payment_type,gender_Male,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0016-QLJIS,Female,0,Yes,Yes,65,Yes,Yes,Yes,Yes,...,DSL,Mailed check,0,0,1,0,0,0,0,1
1,0017-DINOC,Male,0,No,No,54,No,No phone service,Yes,No,...,DSL,Credit card (automatic),1,0,1,0,0,1,0,0
2,0019-GFNTW,Female,0,No,No,56,No,No phone service,Yes,Yes,...,DSL,Bank transfer (automatic),0,0,1,0,0,0,0,0
3,0056-EPFBG,Male,0,Yes,Yes,20,No,No phone service,Yes,No,...,DSL,Credit card (automatic),1,0,1,0,0,1,0,0
4,0078-XZMHT,Male,0,Yes,No,72,Yes,Yes,No,Yes,...,DSL,Bank transfer (automatic),1,0,1,0,0,0,0,0

Extra: Split the telco data

In [208]:
train, test = train_test_split(telco_df, test_size = .2, random_state=17, stratify=telco_df.churn)

In [209]:
print(train.shape)
print(test.shape)

(5634, 29)
(1409, 29)

In [210]:
train, validate = train_test_split(train, test_size=.3, random_state=17, stratify=train.churn)

In [203]:
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

Train: (3943, 29)
Validate: (1691, 29)
Test: (1409, 29)

In [204]:
def split_data(telco_df):
    '''
    Takes in a dataframe and return train, validate, test subset dataframes
    '''
    train, test = train_test_split(df, test_size = .2, random_state=1349, stratify=telco_df.churn)
    train, validate = train_test_split(train, test_size=.3, random_state=1349, stratify=train.churn)
    return train, validate, test

In [205]:
telco_df.shape

(7043, 29)

In [207]:

train, validate, test = split_data(telco_df)
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

ValueError: Found input variables with inconsistent numbers of samples: [150, 7043]